
### Задание 1.1: Калькулятор оценок

grade = int(input('Введите численную оценку:\n'))

if 90 <= grade <= 100:
    print('Буквенная оценка A')
elif 80 <= grade < 90:
    print('Буквенная оценка B')
elif 70 <= grade < 80:
    print('Буквенная оценка C')
elif 60 <= grade < 70:
    print('Буквенная оценка D')
else:
    print('Буквенная оценка F')

### Задание 1.2: Проверка года на високосность

year = int(input('Введите значение года для проверки на високосности:\n'))

if year % 400 == 0 or year % 4 == 0 and year % 100 != 0:
    print('Год високосный')
else:
    print('Год не високосный')

### Задание 1.3: Классификация треугольников

a = int(input('Введите значение первой стороны треугольника:\n'))

b = int(input('Введите значение второй стороны треугольника:\n'))

c = int(input('Введите значение третьей стороны треугольника:\n'))

sides = sorted([a, b, c])
if sides[0] + sides[1] < sides[2]:
    print('Не существует треугольник с такими сторонами')
else:
    if len(set(sides)) == 1:
        print('Равносторонний')
    elif len(set(sides)) == 2:
        print('Равнобедренный')
    else:
        print('Разносторонний')






















#Напишите программу, которая по трем сторонам треугольника определяет его тип:
#- Равносторонний (все стороны равны)
#- Равнобедренный (две стороны равны)
#- Разносторонний (все стороны разные)
#- Не является треугольником (сумма двух сторон меньше третьей)